ART-Badge/SDK/board/osif_for_rtl876x.c
#include <rtthread.h>
#include <stdio.h>
#include <stdint.h>
#include "patch_os.h"
#include "mem_types.h"
#include "os_queue.h"
#include "os_timer.h"
#include "system_rtl876x.h"
#include "rtl876x.h"
#include <rtthread.h>
#include "app_section.h"
#include "osif_for_rtl876x.h"
#include "trace.h"
#include "rtl876x_lib_platform.h"
#include "core_cm4.h"
#include "rtl876x_wdg.h"
#include "flash_device.h"
#include "psram_platform.h"



#define portTICK_PERIOD_MS (1000 / RT_TICK_PER_SECOND)

typedef void (*PendedFunctionOS_t)(uint32_t);

//rt_timer_t timer_numer_array[TIMER_NUMBER_MAX] = {0};
volatile uint32_t pendtick_RTT = 0;

extern uint32_t vector_table_level_two;
extern rt_tick_t rt_tick;
extern void PendSV_Handler(void);
extern void xPortSysTickHandler_RTT(void);
extern rt_base_t rt_hw_interrupt_disable(void);
extern void rt_hw_interrupt_enable(rt_base_t level);
extern rt_mq_t rt_timer_queue;

#define IRQ_NUM (16 + 32)  //16 exceptions + 32 interrupts
IRQ_Fun vector_table_level_one[IRQ_NUM] __attribute__((aligned(0x100)));

extern struct rt_memheap buffer_heap;
extern struct rt_memheap data_heap;
//struct rt_memheap psram_heap;



void common_interrupt_handler(void)
{
    rt_interrupt_enter();
    uint32_t v_num = __get_IPSR();

    IRQ_Fun *pRamVectorTable = (IRQ_Fun *)(vector_table_level_two);

    pRamVectorTable[v_num]();

    rt_interrupt_leave();
}

bool os_systick_handler_RTT(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    rt_tick_increase();

    /* leave interrupt */
    rt_interrupt_leave();

    return true;
}

bool os_delay_RTT(uint32_t ms)
{
    rt_thread_delay((rt_tick_t)((ms + portTICK_PERIOD_MS - 1) / portTICK_PERIOD_MS));

    return true;
}

bool os_sys_time_get_RTT(uint64_t *p_time_ms)
{
    *p_time_ms = (rt_tick_get() * portTICK_PERIOD_MS);

    return true;
}

bool os_sys_tick_get_RTT(uint64_t *p_sys_tick)
{
    *p_sys_tick = (uint64_t)rt_tick_get();

    return true;
}

DATA_RAM_FUNCTION bool os_sys_tick_increase_RTT(uint32_t tick_increment,
                                                rt_tick_t *p_old_tick)  // Change after
{
    rt_base_t level;
    *p_old_tick = rt_tick_get();

    rt_tick_set(rt_tick_get() + tick_increment - 1);

    level = rt_hw_interrupt_disable();
    pendtick_RTT = 1;
    rt_hw_interrupt_enable(level);
    return true;
}

void SetSystemTickInterrupt_RTT(void)
{
    /* Configure SysTick to interrupt at the requested rate. */
    portNVIC_SYSTICK_CTRL_REG = 0UL;
    portNVIC_SYSTICK_LOAD_REG = (configSYSTICK_CLOCK_HZ_RTT / RT_TICK_PER_SECOND) - 1UL;
    portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;
    portNVIC_SYSTICK_CTRL_REG = (portNVIC_SYSTICK_CLK_BIT_RTT | portNVIC_SYSTICK_INT_BIT |
                                 portNVIC_SYSTICK_ENABLE_BIT);
}


bool os_sched_start_RTT(bool *p_result)
{
    rt_base_t level = rt_hw_interrupt_disable();

    rt_tick_set(0);

    SetSystemTickInterrupt_RTT();
    /* Ensure the VFP is enabled - it should be anyway. */
    prvEnableVFP_RTT();


    rt_hw_interrupt_enable(level);

    DBG_DIRECT("USE RTT!!!");
    rt_system_scheduler_start();
    *p_result = true;

    return true;
}


DATA_RAM_FUNCTION bool os_sched_suspend_RTT(bool *p_result)
{
    rt_enter_critical();
    *p_result = true;

    return true;
}

DATA_RAM_FUNCTION bool os_sched_resume_RTT(bool *p_result)
{
    uint32_t uxPendedCounts = pendtick_RTT; /* Non-volatile copy. */
    rt_base_t level;

    rt_exit_critical();
    *p_result = true;

    if (uxPendedCounts > 0)
    {
        do
        {
            rt_tick_increase();

            --uxPendedCounts;
        }
        while (uxPendedCounts > 0);

        level = rt_hw_interrupt_disable();
        pendtick_RTT = 0;
        rt_hw_interrupt_enable(level);
    }

    return true;
}

bool os_sched_is_start_RTT(bool *p_result)
{
    if (rt_thread_self() != NULL)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }
    return true;
}

void xPortSysTickHandler_RTT(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    rt_tick_increase();

    /* leave interrupt */
    rt_interrupt_leave();
}

bool os_vector_table_update_RTT(void)
{
    IRQ_Fun *vectors = (IRQ_Fun *)vector_table_level_two;

    RamVectorTableUpdate(PendSV_VECTORn, (IRQ_Fun)PendSV_Handler);
    RamVectorTableUpdate(SysTick_VECTORn, (IRQ_Fun)xPortSysTickHandler_RTT);

#if 1
    for (uint32_t i = 0; i < 16; ++i)
    {
        vector_table_level_one[i] = vectors[i];
    }

    for (uint32_t i = 16; i < IRQ_NUM; ++i)
    {
        vector_table_level_one[i] = common_interrupt_handler;
    }

    //skip the disasm function
    vector_table_level_one[WDG_VECTORn] = vectors[WDG_VECTORn];
#ifndef _IS_ASIC_
    vector_table_level_one[Peripheral_VECTORn] = vectors[Peripheral_VECTORn];
#endif

    SCB->VTOR = (uint32_t)vector_table_level_one;
#endif

    return true;
}


#if 0
static void rt_hw_board_init(void)
{
    /* Set the clock frequency at 100MHz */
    set_system_clock(SYSTEM_90MHZ);
#ifdef BSP_USING_PSRAM
    /* init psram */
    extern int drv_psram_init(void);
    drv_psram_init();
#endif
    psram_init();
    psram_try_high_speed(FLASH_MODE_4BIT);
#if defined(RT_USING_HEAP)
    /* Heap initialization */
    rt_system_heap_init((void *)(OTP->appDataAddr + OTP->appDataSize + 10 * 1024), \
                        (void *)(OTP->appDataAddr + OTP->appDataSize + OTP->heapDataONSize));
    rt_memheap_init(&buffer_heap, "bufferheap", BUFFER_RAM_ADDR, BUFFER_RAM_SIZE);
    rt_memheap_init(&data_heap, "dataheap", (void *)(OTP->appDataAddr + OTP->appDataSize), 10 * 1024);
    rt_memheap_init(&psram_heap, "psram", (void *)(0x6800000), 4 * 1024 * 1024);
#endif

#ifdef BSP_USING_UART
    /* USART driver initialization is open by default */
    extern int rt_hw_uart_init(void);
    rt_hw_uart_init();
#endif

#ifdef RT_USING_CONSOLE
    /* Set the shell console output device */
    rt_console_set_device(RT_CONSOLE_DEVICE_NAME);
#endif

#ifdef RT_USING_COMPONENTS_INIT
    /* Board underlying hardware initialization */
    rt_components_board_init();
#endif
}
#endif

void RTT_idle_hook(void)
{
    TopOfIdleTaskStack = (uint32_t)rt_thread_self()->stack_addr + \
                         (uint32_t)rt_thread_self()->stack_size + \
                         sizeof(rt_uint32_t) - \
                         sizeof(rt_ubase_t);
    TopOfIdleTaskStack  = RT_ALIGN_DOWN((rt_uint32_t)TopOfIdleTaskStack, 8);
    //rt_kprintf("TopOfIdleTaskStack = 0x%x", TopOfIdleTaskStack);
    if (flash_get_flash_exist() && (rt_critical_level() == 0))
    {
        extern void ftl_garbage_collect_in_idle(void);
        ftl_garbage_collect_in_idle();
    }

    if ((OTP->logDisable == 1) ||
        (!OTP->printAllLogBeforeEnterDLPS) ||
        (OTP->printAllLogBeforeEnterDLPS &&
         PPB_IsOutputBufEmpty(pMCU_PPB) && PPB_IsInputBufEmpty(pMCU_PPB)))
    {
        void dlps_processing(void);
        dlps_processing();
    }

