ART-Badge/SDK/board/osif_for_rtl876x.c
    LogUartDMAIdleHook();

    if (OTP->wdgResetInRom)
    {
        WDG_Restart();
    }
}

bool RTT_init()
{
    log_module_trace_set(MODULE_UPPERSTACK,  LEVEL_TRACE, false);
    log_module_trace_set(MODULE_UPPERSTACK,  LEVEL_INFO, false);

    rt_hw_interrupt_disable();

    rt_hw_board_init();

    rt_show_version();

    /* timer system initialization */
    rt_system_timer_init();

    /* scheduler system initialization */
    rt_system_scheduler_init();

#ifdef RT_USING_SIGNALS
    /* signal system initialization */
    rt_system_signal_init();
#endif

    /* timer thread initialization */
    rt_system_timer_thread_init();

    /* idle thread initialization */
    //  rt_thread_idle_sethook(RTT_idle_hook);
    rt_thread_idle_init();


    return true;
}

bool os_init_RTT(void)
{
    bool xReturn;
    xReturn = RTT_init();
    if (xReturn != true)
    {
        while (1);  //todo
    }
    return true;
}

bool os_task_create_RTT(void **pp_handle, const char *p_name, void (*p_routine)(void *),
                        void *p_param, uint16_t stack_size, uint16_t priority, bool *p_is_create_success)
{
    rt_thread_t ret;
    *p_is_create_success = false;

    if (pp_handle)
    {
#ifndef BSP_USING_BLE
        if(!rt_memcmp(p_name, "low_", 4))
        {
            DBG_DIRECT("not start the low statck");
            *p_is_create_success = true;
            return true;
        }
        if(!rt_memcmp(p_name, "Uppe", 4))
        {
            DBG_DIRECT("not start the upper statck");
            *p_is_create_success = true;
            return true;
        }
#endif
        uint16_t switch_priority = RT_THREAD_PRIORITY_MAX - 1 - priority;
        ret = rt_thread_create((const char *)p_name, p_routine, p_param, stack_size, switch_priority, 2);
        if (ret != RT_NULL)
        {
            *p_is_create_success = true;
            *pp_handle = ret;

            rt_thread_startup(ret);
        }
    }

    return true;
}

bool os_task_delete_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_thread_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_thread_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    ret = rt_thread_delete(obj);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_task_suspend_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_thread_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_thread_t)p_handle;
    ret = rt_thread_suspend(obj);

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    rt_schedule();

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_task_resume_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_thread_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_thread_t)p_handle;
    ret = rt_thread_resume(obj);

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    rt_schedule();

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_task_yield_RTT(bool *p_result)
{
    rt_err_t ret;

    ret = rt_thread_yield();

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_task_handle_get_RTT(void **pp_handle, bool *p_result)
{
    if (pp_handle == NULL)
    {
        *p_result = false;
        return true;
    }

    *pp_handle = (void *)rt_thread_self();
    *p_result = true;

    return true;
}

bool os_task_name_get_RTT(void *p_handle, char **p_task_name, bool *p_result)
{
    rt_thread_t obj;

    if (p_handle != NULL)
    {
        obj = (rt_thread_t)p_handle;
    }
    else
    {
        obj = rt_thread_self();
    }
    *p_task_name = obj->name;

    *p_result = true;

    return true;
}

bool os_task_priority_get_RTT(void *p_handle, uint16_t *p_priority, bool *p_result)
{
    if (p_priority == NULL)
    {
        *p_result = false;
        return true;
    }

    uint16_t priority;
    rt_base_t lock;
    rt_thread_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    if (p_handle != NULL)
    {
        obj = (rt_thread_t)p_handle;
    }
    else
    {
        obj = rt_thread_self();
    }
    priority = obj->current_priority ;
    *p_priority = RT_THREAD_PRIORITY_MAX - 1 - priority;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    *p_result = true;

    return true;
}

bool os_task_priority_set_RTT(void *p_handle, uint16_t priority, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_thread_t obj;
    uint16_t switch_priority = RT_THREAD_PRIORITY_MAX - 1 - priority;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    if (p_handle != NULL)
    {
        obj = (rt_thread_t)p_handle;
    }
    else
    {
        obj = rt_thread_self();
    }

    ret = rt_thread_control(obj, RT_THREAD_CTRL_CHANGE_PRIORITY, &switch_priority);

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    rt_schedule();

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

void vTaskStatusDump_RTT(void)
{
    rt_thread_t cur_thread = rt_thread_self();
    DBG_DIRECT("pxCurrentTCB %p, pxTopOfStack %p,taks_pri:%d",
               cur_thread, cur_thread->sp, RT_THREAD_PRIORITY_MAX - 1 - cur_thread->current_priority);
}

bool os_task_status_dump_RTT(void)
{
    extern void vTaskStatusDump_RTT(void);
    vTaskStatusDump_RTT();

    return true;
}



DATA_RAM_FUNCTION __asm void prvEnableVFP_RTT(void)
{
    PRESERVE8

    /* The FPU enable bits are in the CPACR. */
    ldr.w r0, = 0xE000ED88
                ldr r1, [r0]

                /* Enable CP10 and CP11 coprocessors, then save back. */
                //              orr r1, r1, #( 0xf << 20 )
                orr r1, r1, #0xf00000
                str r1, [r0]
                bx  r14
                nop
}

DATA_RAM_FUNCTION void xPortStartSchedulerInRestore_RTT(void)
{
    /* Make PendSV and SysTick the lowest priority interrupts. */
    portNVIC_SYSPRI2_REG |= portNVIC_PENDSV_PRI;
    portNVIC_SYSPRI2_REG |= portNVIC_SYSTICK_PRI;

    /* Start the timer that generates the tick ISR.  Interrupts are disabled
    here already. */
    //vPortSetupTimerInterrupt(); // move to lps_handle_sm_intr()

    /* Ensure the VFP is enabled - it should be anyway. */
    prvEnableVFP_RTT();

    /* Lazy save always. */
    *(portFPCCR) |= portASPEN_AND_LSPEN_BITS;

    __DSB();
    __ISB();
}

/* *INDENT-OFF* */
DATA_RAM_FUNCTION __asm void DLPS_ReturnIdleTask_RTT()
{
//    extern xPortStartSchedulerInRestore_RTT
//    extern rt_thread_idle_entry
//    extern TopOfIdleTaskStack
//    PRESERVE8

