ART-Badge/SDK/board/osif_for_rtl876x.c
//    bl  xPortStartSchedulerInRestore_RTT

//    /* Use the NVIC offset register to locate the stack. */
//    ldr r0, =0xE000ED08
//    ldr r0, [r0]
//    ldr r0, [r0]
//    /* Set the msp back to the start of the stack. */
//    msr msp, r0
//    isb

//    /* Update psp of the idle task */
//    ldr r0, =TopOfIdleTaskStack
//    ldr r0, [r0]
//    msr psp, r0
//    isb

//    /* Switch to the psp stack. */
//    mrs r0, CONTROL
//    orr  r0, r0, #2
//    msr CONTROL, r0
//    isb

//    /* Jump to the entry of the idle task */
//    ldr r0, =rt_thread_idle_entry
//    bx r0

//LOOP_NOP
//    nop
//    B LOOP_NOP
//    ALIGN
}

bool os_task_dlps_return_idle_task_RTT(void)   //change after
{
    //DBG_DIRECT("EXIT LINE = %d",__LINE__);
    extern void DLPS_ReturnIdleTask_RTT(void);
    DLPS_ReturnIdleTask_RTT();

    return true;
}

bool os_lock_RTT(uint32_t *p_flags)
{
    rt_base_t lock;

    lock = rt_hw_interrupt_disable();

    *p_flags = lock;

    return true;
}

bool os_unlock_RTT(uint32_t flags)
{
    rt_base_t lock = flags;

    rt_hw_interrupt_enable(lock);

    return true;
}

bool os_sem_create_RTT(void **pp_handle, uint32_t init_count, uint32_t max_count, bool *p_result)
{
    rt_sem_t ret;

    *p_result = false;

    if (pp_handle)
    {
        ret = rt_sem_create("sem", init_count, RT_IPC_FLAG_FIFO);

        if (ret != RT_NULL)
        {
            *p_result = true;
            *pp_handle = (void *)ret;
        }
        else
        {
            *p_result = false;
        }
    }

    return true;
}

bool os_sem_delete_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_sem_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_sem_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    ret = rt_sem_delete(obj);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_sem_take_RTT(void *p_handle, uint32_t wait_ms, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_sem_t obj;
    rt_tick_t wait_ticks;

    if (p_handle == NULL)
    {
        *p_result = false;
        return true;
    }

    if (rt_interrupt_get_nest() != 0)
    {
        *p_result = false;
        return true;
    }

//    if (rt_critical_level() != 0)
//    {
//        *p_result = false;
//        return true;
//    }

    bool result;
    os_sched_is_start_RTT(&result);
    if (result == false)
    {
        *p_result = true;
        return true;
    }

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_sem_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    if (wait_ms == 0xFFFFFFFFUL)
    {
        ret = rt_sem_take(obj, RT_WAITING_FOREVER);
    }
    else
    {
        wait_ticks = (rt_tick_t)((wait_ms + portTICK_PERIOD_MS - 1) / portTICK_PERIOD_MS);
        ret = rt_sem_take(obj, wait_ticks);
    }

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_sem_give_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_sem_t obj;

    if (p_handle == NULL)
    {
        *p_result = false;
        return true;
    }

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_sem_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    ret = rt_sem_release(obj);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_mutex_create_RTT(void **pp_handle, bool *p_result)
{
    rt_mutex_t ret;
    *p_result = false;

    if (pp_handle)
    {
        ret = rt_mutex_create("mutex", RT_IPC_FLAG_FIFO);

        if (ret != RT_NULL)
        {
            *p_result = true;
            *pp_handle = (void *)ret;
        }
    }

    return true;
}

bool os_mutex_delete_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_mutex_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_mutex_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    ret = rt_mutex_delete(obj);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_mutex_take_RTT(void *p_handle, uint32_t wait_ms, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_mutex_t obj;
    rt_tick_t wait_ticks;

    if (p_handle == NULL)
    {
        *p_result = false;
        return true;
    }

    if (rt_interrupt_get_nest() != 0)
    {
        *p_result = false;
        return true;
    }

    bool result;
    os_sched_is_start_RTT(&result);
    if (result == false)
    {
        *p_result = true;
        return true;
    }

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_mutex_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    if (wait_ms == 0xFFFFFFFFUL)
    {
        ret = rt_mutex_take(obj, RT_WAITING_FOREVER);
    }
    else
    {
        wait_ticks = (rt_tick_t)((wait_ms + portTICK_PERIOD_MS - 1) / portTICK_PERIOD_MS);
        ret = rt_mutex_take(obj, wait_ticks);
    }

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_mutex_give_RTT(void *p_handle, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_mutex_t obj;

    if (p_handle == NULL)
    {
        *p_result = false;
        return true;
    }

    if (rt_interrupt_get_nest() != 0)
    {
        *p_result = false;
        return true;
    }

    bool result;
    os_sched_is_start_RTT(&result);
    if (result == false)
    {
        *p_result = true;
        return true;
    }

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_mutex_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    ret = rt_mutex_release(obj);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

