ART-Badge/SDK/board/osif_for_rtl876x.c
    return true;
}

bool os_msg_queue_create_intern_RTT(void **pp_handle, uint32_t msg_num, uint32_t msg_size,
                                    const char *p_func, uint32_t file_line, bool *p_result)
{
    rt_mq_t ret;
    *p_result = false;

    if (pp_handle)
    {
        ret = rt_mq_create("queue", msg_size, msg_num, RT_IPC_FLAG_FIFO);

        if (ret != RT_NULL)
        {
            *p_result = true;
            *pp_handle = (void *)ret;
        }
        else
        {
            *p_result = false;
        }
    }

    return true;
}

bool os_msg_queue_delete_intern_RTT(void *p_handle, const char *p_func, uint32_t file_line,
                                    bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_mq_t obj;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_mq_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    ret = rt_mq_delete(obj);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_msg_queue_peek_intern_RTT(void *p_handle, uint32_t *p_msg_num,
                                  const char *p_func, uint32_t file_line, bool *p_result)
{
    rt_mq_t obj;
    rt_base_t lock;

    if (p_handle)
    {
        /* disable interrupt */
        lock = rt_hw_interrupt_disable();

        obj = (rt_mq_t)p_handle;
        *p_msg_num = obj->entry;

        /* enable interrupt */
        rt_hw_interrupt_enable(lock);

        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_msg_send_intern_RTT(void *p_handle, void *p_msg, uint32_t wait_ms,
                            const char *p_func, uint32_t file_line, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_mq_t obj;
    rt_tick_t wait_ticks;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_mq_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    if (wait_ms == 0xFFFFFFFFUL)
    {
        ret = rt_mq_send_wait(obj, p_msg, obj->msg_size, RT_WAITING_FOREVER);
    }
    else
    {
        wait_ticks = (rt_tick_t)((wait_ms + portTICK_PERIOD_MS - 1) / portTICK_PERIOD_MS);
        ret = rt_mq_send_wait(obj, p_msg, obj->msg_size, wait_ticks);
    }


    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}

bool os_msg_recv_intern_RTT(void *p_handle, void *p_msg, uint32_t wait_ms,
                            const char *p_func, uint32_t file_line, bool *p_result)
{
    rt_err_t ret;
    rt_base_t lock;
    rt_mq_t obj;
    rt_tick_t wait_ticks;

    /* disable interrupt */
    lock = rt_hw_interrupt_disable();

    obj = (rt_mq_t)p_handle;

    /* enable interrupt */
    rt_hw_interrupt_enable(lock);

    if (wait_ms == 0xFFFFFFFFUL)
    {
        ret = rt_mq_recv(obj, p_msg, obj->msg_size, RT_WAITING_FOREVER);
    }
    else
    {
        wait_ticks = (rt_tick_t)((wait_ms + portTICK_PERIOD_MS - 1) / portTICK_PERIOD_MS);
        ret = rt_mq_recv(obj, p_msg, obj->msg_size, wait_ticks);
    }

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }

    return true;
}


bool os_mem_peek_RTT(RAM_TYPE ram_type, size_t *p_size)
{

    if (ram_type == 0)
    {
        *p_size =  data_heap.available_size;
    }
    else if (ram_type == 1)
    {
        *p_size =  buffer_heap.available_size;
    }

    return true;
}

bool os_mem_check_heap_usage_RTT(void)
{
    return true;
}

bool os_mem_alloc_intern_RTT(RAM_TYPE ram_type, size_t size,
                             const char *p_func, uint32_t file_line, void **pp)
{
    size_t unused_size;
    os_mem_peek_RTT(ram_type, &unused_size);

    if (OTP->run_in_app == 1)
    {
        *pp = rt_malloc(size);
    }
    else
    {
        if (ram_type == 0)
        {
            *pp = rt_memheap_alloc(&data_heap, size);
        }
        else if (ram_type == 1)
        {
            *pp = rt_memheap_alloc(&buffer_heap, size);
        }
    }

    if (*pp == NULL)
    {
        OSIF_PRINT_ERROR5("os_mem_alloc_intern: %s<%u> ram type %u, required size %u, unused size %u",
                          TRACE_STRING(p_func), file_line, ram_type, size, unused_size);
    }
    return true;
}

bool os_mem_zalloc_intern_RTT(RAM_TYPE ram_type, size_t size,
                              const char *p_func, uint32_t file_line, void **pp)
{
    size_t unused_size;
    os_mem_peek_RTT(ram_type, &unused_size);

    if (OTP->run_in_app == 1)
    {
        *pp = rt_malloc(size);
    }
    else
    {
        if (ram_type == 0)
        {
            *pp = rt_memheap_alloc(&data_heap, size);
        }
        else if (ram_type == 1)
        {
            *pp = rt_memheap_alloc(&buffer_heap, size);
        }
    }

    if (*pp)
    {
        rt_memset(*pp, 0, size);
    }

    if (*pp == NULL)
    {
        OSIF_PRINT_ERROR5("os_mem_zalloc_intern: %s<%u> ram type %u, required size %u, unused size %u",
                          TRACE_STRING(p_func), file_line, ram_type, size, unused_size);
    }

    return true;
}

bool os_mem_aligned_alloc_intern_RTT(RAM_TYPE ram_type, size_t size, uint8_t alignment,
                                     const char *p_func, uint32_t file_line, void **pp)
{
    void *p = NULL;
    void *p_aligned;

    if (alignment == 0)
    {
        alignment = RT_ALIGN_SIZE;
    }

    size_t unused_size;
    os_mem_peek_RTT(ram_type, &unused_size);

    if (OTP->run_in_app == 1)
    {
        *pp = rt_malloc(size + sizeof(void *) + alignment);
    }
    else
    {
        if (ram_type == 0)
        {
            *pp = rt_memheap_alloc(&data_heap, size + sizeof(void *) + alignment);
        }
        else if (ram_type == 1)
        {
            *pp = rt_memheap_alloc(&buffer_heap, size + sizeof(void *) + alignment);
        }
    }

    if (p == NULL)
    {
        OSIF_PRINT_ERROR5("os_mem_aligned_alloc_intern: %s<%u> ram type %u, required size %u, unused size %u",
                          TRACE_STRING(p_func), file_line, ram_type, size, unused_size);
        return true;
    }

    p_aligned = (void *)(((size_t)p + sizeof(void *) + alignment) & ~(alignment - 1));

