ART-Badge/SDK/board/osif_for_rtl876x.c
    rt_memcpy((uint8_t *)p_aligned - sizeof(void *), &p, sizeof(void *));

    *pp = p_aligned;

    return true;
}

bool os_mem_free_RTT(void *p_block)
{
    rt_free(p_block);
    return true;
}

bool os_mem_aligned_free_RTT(void *p_block)
{
    void *p;

    rt_memcpy(&p, (uint8_t *)p_block - sizeof(void *), sizeof(void *));

    rt_free(p);

    return true;
}



struct osif_timer_list
{
    struct rt_timer *timer_handle; //save the rtt handle
    uint32_t osif_timer_id;
    uint32_t timer_number;
    rt_slist_t timer_list;
};
typedef struct osif_timer_list osif_timer_list_t;
static uint8_t timer_number_index;

static rt_slist_t _osif_timer_head = RT_SLIST_OBJECT_INIT(_osif_timer_head);

osif_timer_list_t *osif_timer_get_entry(void *p_handle)
{
    osif_timer_list_t *h_timer;

    struct rt_slist_node *node = NULL;
    rt_base_t lock;
    lock = rt_hw_interrupt_disable();
    rt_slist_for_each(node, &_osif_timer_head)
    {
        h_timer = rt_list_entry(node, struct osif_timer_list, timer_list);
        if (h_timer->timer_handle == p_handle)
        {
            rt_hw_interrupt_enable(lock);
            return h_timer;
        }
    }
    rt_hw_interrupt_enable(lock);
    DBG_DIRECT("%s, couldn't find the handle : %p ", __func__, p_handle);

    return NULL;

}

bool osif_timer_insert_entry(void *p_handle, uint32_t timer_id, bool timer_status, uint8_t timer_number)
{
    osif_timer_list_t *node_timer;
    rt_base_t lock;
    node_timer  = RT_KERNEL_MALLOC(sizeof(osif_timer_list_t));
    if (node_timer == NULL)
    {
        return false;
    }
    node_timer->timer_handle = p_handle;
    node_timer->osif_timer_id = timer_id;
    node_timer->timer_number = timer_number;

    lock = rt_hw_interrupt_disable();
    rt_slist_init(&node_timer->timer_list);
    rt_slist_append(&_osif_timer_head, &node_timer->timer_list);
    rt_hw_interrupt_enable(lock);
    return true;
}

void *osif_timer_remove_entry(void *p_handle)
{
    osif_timer_list_t *h_timer;
    struct rt_slist_node *node = NULL;
    rt_base_t lock;
    lock = rt_hw_interrupt_disable();
    rt_slist_for_each(node, &_osif_timer_head)
    {
        h_timer = rt_list_entry(node, struct osif_timer_list, timer_list);
        if (h_timer->timer_handle == p_handle)
        {
            rt_slist_remove(&_osif_timer_head, node);
            RT_KERNEL_FREE(h_timer);
            rt_hw_interrupt_enable(lock);
            return NULL;
        }
    }
    rt_hw_interrupt_enable(lock);

    DBG_DIRECT("%s, couldn't find the handle : %p ", __func__, p_handle);

    return NULL;

}


bool os_timer_id_get_RTT(void **pp_handle, uint32_t *p_timer_id, bool *p_result)
{
    *p_result = false;
    if (pp_handle == NULL || *pp_handle == NULL)
    {
        return false;
    }

    if (pp_handle && *pp_handle)
    {
        osif_timer_list_t *p_handle_timer;
        p_handle_timer = osif_timer_get_entry(*pp_handle);
        *p_timer_id = p_handle_timer->osif_timer_id;
        *p_result = true;
    }
    return true;
}



bool os_timer_create_RTT(void **pp_handle, const char *p_timer_name, uint32_t timer_id,
                         uint32_t interval_ms, bool reload, void (*p_timer_callback)(), bool *p_result)
{
    rt_timer_t ret = NULL;
    rt_tick_t timer_ticks;
    *p_result = false;

    if (pp_handle == NULL || p_timer_callback == NULL)
    {
        DBG_DIRECT("FAIL!!!! TEST %s  LINE %d, timer_id %d", __func__, __LINE__);
        return false;
    }
    timer_ticks = (rt_tick_t) interval_ms * RT_TICK_PER_SECOND / 1000;

    if (*pp_handle == NULL)
    {

        if (reload == true)
        {
            ret = rt_timer_create(p_timer_name, p_timer_callback, (void *)(*pp_handle), timer_ticks,
                                  RT_TIMER_FLAG_PERIODIC | RT_TIMER_FLAG_SOFT_TIMER);
        }
        else
        {
            ret = rt_timer_create(p_timer_name, p_timer_callback, (void *)(*pp_handle), timer_ticks,
                                  RT_TIMER_FLAG_ONE_SHOT | RT_TIMER_FLAG_SOFT_TIMER);
        }
    }
    if (ret == NULL)
    {
        DBG_DIRECT("FAIL!!!! TEST %s  LINE %d, timer_id %d", __func__, __LINE__);
        return false;
    }
    ret->parameter = ret;
    *pp_handle = ret;

    osif_timer_insert_entry(*pp_handle, timer_id, false, timer_number_index);

    timer_number_index++;
    *p_result = true;
    return true;
}

bool os_timer_start_RTT(void **pp_handle, bool *p_result)
{
    rt_err_t ret;
    *p_result = false;
    if (pp_handle == NULL || *pp_handle == NULL)
    {
        return false;
    }

    rt_timer_queue_cb cb;
    cb.timer  = (rt_timer_t) * pp_handle;
    cb.cb_num = RT_TIMER_CMD_START;
    ret = rt_mq_send(rt_timer_queue, &cb, sizeof(rt_timer_queue_cb));

    if (ret == RT_EOK)
    {
        *p_result = true;
    }


    //DBG_DIRECT("[RTT][TIMER] name = %s;LINE = %d", ((rt_timer_t )*pp_handle)->parent.name,__LINE__);
    return true;
}

bool os_timer_restart_RTT(void **pp_handle, uint32_t interval_ms, bool *p_result)
{
    rt_err_t ret;
    rt_timer_queue_cb cb;
    rt_tick_t timer_ticks;

    *p_result = false;

    timer_ticks = (rt_tick_t)((interval_ms + portTICK_PERIOD_MS - 1) / portTICK_PERIOD_MS);

    if (pp_handle && *pp_handle && (timer_ticks > 0))
    {
        cb.timer  = (rt_timer_t) * pp_handle;
        cb.cb_num = RT_TIMER_CMD_RESTART;
        cb.change_tick = (void *)timer_ticks;
        ret = rt_mq_send(rt_timer_queue, &cb, sizeof(rt_timer_queue_cb));

        if (ret == RT_EOK)
        {
            *p_result = true;
        }
    }

    return true;
}

bool os_timer_stop_RTT(void **pp_handle, bool *p_result)
{
    rt_err_t ret;
    rt_timer_queue_cb cb;
    *p_result = false;

    if (pp_handle && *pp_handle)
    {
        cb.timer  = (rt_timer_t) * pp_handle;
        cb.cb_num = RT_TIMER_CMD_STOP;
        ret = rt_mq_send(rt_timer_queue, &cb, sizeof(rt_timer_queue_cb));

        if (ret == RT_EOK)
        {
            *p_result = true;
        }
    }

    return true;
}



bool os_timer_delete_RTT(void **pp_handle, bool *p_result)
{
    rt_err_t ret;
    if (pp_handle == NULL || *pp_handle == NULL)
    {
        DBG_DIRECT("FAIL!!! TEST %s  LINE %d ", __func__, __LINE__);
        return false;
    }

    rt_timer_queue_cb cb;
    cb.timer  = (rt_timer_t) * pp_handle;
    cb.cb_num = RT_TIMER_CMD_DEL;
    ret = rt_mq_send(rt_timer_queue, &cb, sizeof(rt_timer_queue_cb));

    if (ret == RT_EOK)
    {
        *p_result = true;
    }

    osif_timer_remove_entry(*pp_handle);
    *p_result = true;
    return true;
}

bool os_timer_dump_RTT(bool *p_result)
{
    return true;
}

bool os_timer_state_get_RTT(void **pp_handle, uint32_t *p_timer_state, bool *p_result)
{
    rt_base_t lock;
    rt_timer_t obj;

