ART-Badge/SDK/board/osif_for_rtl876x.c
    *p_result = false;

    if (pp_handle && *pp_handle)
    {
        /* disable interrupt */
        lock = rt_hw_interrupt_disable();

        obj = (rt_timer_t)(*pp_handle);
        RT_ASSERT(rt_object_get_type(&obj->parent) == RT_Object_Class_Timer);

        if (obj->parent.flag & RT_TIMER_FLAG_ACTIVATED)
        {
            /*timer is start and run*/
            *(rt_tick_t *)p_timer_state = RT_TIMER_FLAG_ACTIVATED;
        }
        else
        {
            /*timer is stop*/
            *(rt_tick_t *)p_timer_state = RT_TIMER_FLAG_DEACTIVATED;
        }

        /* enable interrupt */
        rt_hw_interrupt_enable(lock);

        *p_result = true;
    }

    return true;
}

bool os_timer_init_RTT(void)
{
    extern rt_mq_t rt_timer_queue;
    extern rt_thread_t rt_timer_task;
    extern void timer_task(void *pa);

    rt_timer_queue = rt_mq_create("timer_queue", sizeof(rt_timer_queue_cb), TIMER_NUMBER_MAX,
                                  RT_IPC_FLAG_FIFO);
    rt_timer_task = rt_thread_create("timer_task_RTT", timer_task, NULL, 512, 0, 2);

    if (rt_timer_task != RT_NULL)
    {
        rt_thread_startup(rt_timer_task);
    }
    return true;
}

bool os_timer_number_get_RTT(void **pp_handle, uint32_t *p_timer_num, bool *p_result)
{
    rt_base_t lock;

    if (pp_handle && *pp_handle)
    {
        osif_timer_list_t *p_handle_timer;
        lock = rt_hw_interrupt_disable();
        p_handle_timer = osif_timer_get_entry(*pp_handle);
        *p_timer_num = p_handle_timer->timer_number;
        rt_hw_interrupt_enable(lock);
        *p_result = true;
        return true;
    }
    else
    {
        *p_timer_num = 0xFF;
        *p_result = false;
    }

    return true;
}

rt_err_t xPendFunctionCall_RTT(PendedFunctionOS_t xFunctionToPend, uint32_t pvParameter1)
{
    rt_timer_queue_cb cb;
    rt_err_t ret;

    cb.pxCallbackFunction = xFunctionToPend;
    cb.pvParameter1 = pvParameter1;
    cb.cb_num = RT_TIMER_EXCUTE_CALLBACK;

    ret = rt_mq_send(rt_timer_queue, &cb, sizeof(rt_timer_queue_cb));

    return ret;
}

bool os_timer_pendcall_RTT(PendedFunctionOS_t xFunctionToPend, uint32_t Parameter1,
                           bool *p_result)
{
    uint32_t ret;

    ret = xPendFunctionCall_RTT(xFunctionToPend, Parameter1);

    if (ret == RT_EOK)
    {
        *p_result = true;
    }
    else
    {
        *p_result = false;
    }
    return true;
}

#include "trace.h"
#include "otp.h"
#include "dlps.h"

rt_mq_t rt_timer_queue;
rt_thread_t rt_timer_task;

static void cmd_proc(rt_timer_queue_cb *cb, uint8_t cmd)
{
    rt_timer_t timer;
    timer = cb->timer;
    rt_base_t lock;

    switch (cmd)
    {
    case RT_TIMER_CMD_START:
        rt_timer_start(timer);
        break;
    case RT_TIMER_CMD_STOP:
        rt_timer_stop(timer);
        break;
    case RT_TIMER_CMD_RESTART:
        lock = rt_hw_interrupt_disable();
        rt_timer_stop(timer);
        rt_timer_control(timer, RT_TIMER_CTRL_SET_TIME, &(cb->change_tick));
        rt_timer_start(timer);
        rt_hw_interrupt_enable(lock);
        break;
    case RT_TIMER_CMD_DEL:
        rt_timer_stop(timer);
        rt_timer_delete(timer);
        break;
    case RT_TIMER_EXCUTE_CALLBACK:
        cb->pxCallbackFunction(cb->pvParameter1);
        break;
    default:
        break;
    }
}

static void timer_cmd_proc(rt_timer_queue_cb *cb)
{
    cmd_proc(cb, cb->cb_num);
}

void timer_task(void *pa)
{
    rt_timer_queue_cb cb_msg;
    while (1)
    {
        if (rt_mq_recv(rt_timer_queue, &cb_msg, sizeof(cb_msg), RT_WAITING_FOREVER) == RT_EOK)
        {
            timer_cmd_proc(&cb_msg);
        }
    }
}



static DATA_RAM_FUNCTION rt_tick_t rt_timer_list_next_timeout_RTT(rt_list_t timer_list[])
{
    char *excluded_handle_RTT[] = {"timer", "timer_task_RTT", "low_stack_task", "dbg_tid_timer", "THERMAL_TIMER", "feature_check_timer", "tidle0"};
    struct rt_timer *timer;
    register rt_base_t level;
    rt_tick_t timeout_tick = RT_TICK_MAX;
    rt_list_t *n;

    /* disable interrupt */
    level = rt_hw_interrupt_disable();

    if (!rt_list_isempty(&timer_list[RT_TIMER_SKIP_LIST_LEVEL - 1]))
    {
        for (n = timer_list[RT_TIMER_SKIP_LIST_LEVEL - 1].next;
             n != &(timer_list[RT_TIMER_SKIP_LIST_LEVEL - 1]);)
        {
            bool handle_checked = 1;
            timer = rt_list_entry(n, struct rt_timer, row[RT_TIMER_SKIP_LIST_LEVEL - 1]);
            for (uint32_t i = 0; i < sizeof(excluded_handle_RTT) / sizeof(char *); i ++)
            {
                if (rt_strcmp(timer->parent.name, excluded_handle_RTT[i]) == 0)
                {
                    handle_checked = 0;
                    break;
                }
            }
            if (handle_checked)
            {
                timeout_tick = timer->timeout_tick;
                break;
            }
            n = n->next;
        }
    }

    /* enable interrupt */
    rt_hw_interrupt_enable(level);

    return timeout_tick;
}


static DATA_RAM_FUNCTION rt_tick_t find_nearest_timeout_tick_RTT(void)
{
    extern rt_list_t rt_soft_timer_list[];
    extern rt_list_t rt_timer_list[];
    rt_tick_t current_tick;
    rt_tick_t next_timeout = rt_timer_list_next_timeout_RTT(rt_soft_timer_list);

    rt_tick_t next_timeout1 = rt_timer_list_next_timeout_RTT(rt_timer_list);

    if (next_timeout1 < next_timeout)
    {
        next_timeout = next_timeout1;
    }

    /* get current tick */
    current_tick = rt_tick_get();

    if ((next_timeout - current_tick) < RT_TICK_MAX / 2)
    {
        /* get the delta timeout tick */
        next_timeout = next_timeout - current_tick;
    }

    return next_timeout;
}



static DATA_RAM_FUNCTION uint32_t DLPS_CheckNextTimeout(void)
{
    extern uint32_t get_valid_systick_current_value_and_update_tick_count(void);
    uint32_t systick_current_value = get_valid_systick_current_value_and_update_tick_count();

    rt_tick_t nearest_timeout_tick = find_nearest_timeout_tick_RTT();

    if (nearest_timeout_tick == RT_TICK_MAX)
    {
        nearest_timeout_tick = 0xFFFFFFFF;
    }
    // xTickCount unit 10msec, wakeup time unit 0.625msec
    if ((nearest_timeout_tick != 0xFFFFFFFF) && (nearest_timeout_tick != 0))
    {
        rt_tick_t wakeup_time_us = nearest_timeout_tick * 10000 - DIVIDE_AND_ROUNDUP((
                SYSTICK_RELOAD_VALUE_RTT - systick_current_value) * 1000000,
                                                                                     configSYSTICK_CLOCK_HZ_RTT) - last_lps_remain_us_get();

        rt_tick_t wakeup_time_slot = wakeup_time_us / 625;

        return (wakeup_time_slot > 0x7D00) ? 0x7D00 : wakeup_time_slot;
    }

    return (uint32_t)nearest_timeout_tick;
}

DATA_RAM_FUNCTION bool os_timer_next_timeout_value_get_RTT(uint32_t *p_value)
{
    *p_value = DLPS_CheckNextTimeout();
    return true;
}

//Call this function in app entry but not in OTA mode
void osif_update_for_rtt(void)
{
    patch_osif_os_init = os_init_RTT;
    patch_osif_os_vector_table_update = os_vector_table_update_RTT;
    patch_osif_os_systick_handler = os_systick_handler_RTT;
    patch_osif_os_delay = os_delay_RTT;
    patch_osif_os_sys_time_get = os_sys_time_get_RTT;
    patch_osif_os_sys_tick_get = os_sys_tick_get_RTT;
    patch_osif_os_sys_tick_increase = os_sys_tick_increase_RTT;
    patch_osif_os_sched_start = os_sched_start_RTT;
    patch_osif_os_sched_suspend = os_sched_suspend_RTT;
    patch_osif_os_sched_resume = os_sched_resume_RTT;
    patch_osif_os_sched_is_start = os_sched_is_start_RTT;

