ART-Badge/SDK/board/osif_for_rtl876x.c
    patch_osif_os_task_create = os_task_create_RTT;
    patch_osif_os_task_delete = os_task_delete_RTT;
    patch_osif_os_task_suspend = os_task_suspend_RTT;
    patch_osif_os_task_resume = os_task_resume_RTT;
    patch_osif_os_task_yield = os_task_yield_RTT;
    patch_osif_os_task_handle_get = os_task_handle_get_RTT;
    patch_osif_os_task_priority_get = os_task_priority_get_RTT;
    patch_osif_os_task_priority_set = os_task_priority_set_RTT;
    patch_osif_os_task_status_dump = os_task_status_dump_RTT;
    patch_osif_os_task_dlps_return_idle_task = os_task_dlps_return_idle_task_RTT;

    patch_osif_os_lock = os_lock_RTT;
    patch_osif_os_unlock = os_unlock_RTT;
    patch_osif_os_sem_create = os_sem_create_RTT;
    patch_osif_os_sem_delete = os_sem_delete_RTT;
    patch_osif_os_sem_take = os_sem_take_RTT;
    patch_osif_os_sem_give = os_sem_give_RTT;
    patch_osif_os_mutex_create = os_mutex_create_RTT;
    patch_osif_os_mutex_delete = os_mutex_delete_RTT;
    patch_osif_os_mutex_take = os_mutex_take_RTT;
    patch_osif_os_mutex_give = os_mutex_give_RTT;

    patch_osif_os_msg_queue_create_intern = os_msg_queue_create_intern_RTT;
    patch_osif_os_msg_queue_delete_intern = os_msg_queue_peek_intern_RTT;
    patch_osif_os_msg_queue_peek_intern = os_msg_queue_peek_intern_RTT;
    patch_osif_os_msg_send_intern = os_msg_send_intern_RTT;
    patch_osif_os_msg_recv_intern = os_msg_recv_intern_RTT;

    patch_osif_os_mem_alloc_intern = os_mem_alloc_intern_RTT;
    patch_osif_os_mem_zalloc_intern = os_mem_zalloc_intern_RTT;
    patch_osif_os_mem_aligned_alloc_intern = os_mem_aligned_alloc_intern_RTT;
    patch_osif_os_mem_free = os_mem_free_RTT;
    patch_osif_os_mem_aligned_free = os_mem_aligned_free_RTT;
    patch_osif_os_mem_peek = os_mem_peek_RTT;
    patch_osif_os_mem_check_heap_usage = os_mem_check_heap_usage_RTT;

    patch_osif_os_timer_init = os_timer_init_RTT;
    patch_osif_os_timer_create =  os_timer_create_RTT;
    patch_osif_os_timer_start = os_timer_start_RTT;
    patch_osif_os_timer_restart = os_timer_restart_RTT;
    patch_osif_os_timer_stop = os_timer_stop_RTT;
    patch_osif_os_timer_delete = os_timer_delete_RTT;
    patch_osif_os_timer_id_get = os_timer_id_get_RTT;
    patch_osif_os_timer_state_get = os_timer_state_get_RTT;
    patch_osif_os_timer_dump = os_timer_dump_RTT;
    patch_osif_os_timer_number_get = os_timer_number_get_RTT;
    patch_osif_os_timer_pendcall = os_timer_pendcall_RTT;
    patch_osif_os_timer_next_timeout_value_get = os_timer_next_timeout_value_get_RTT;

}

USER_CALL_BACK os_patch = osif_update_for_rtt;



